In [1]:
import sqlite3 as sql
import pandas as pd

active_airlines_query = \
"""
SELECT COUNT() AS "Active airlines"
FROM airlines
WHERE active = 'Y'
"""
inactive_airlines_query = \
"""
SELECT COUNT() AS "Inactive airlines"
FROM airlines
WHERE active = 'N'
"""
with sql.connect("data/flights.db") as conn:
    active_df = pd.read_sql(active_airlines_query, conn)

with sql.connect("data/flights.db") as conn:
    inactive_df = pd.read_sql(inactive_airlines_query, conn)

print(active_df)
print(inactive_df)

   Active airlines
0             1161
   Inactive airlines
0               4886

In [2]:
grouped_airlines_query = \
"""
SELECT active, 
    COUNT() AS "Number of airlines"
FROM airlines
GROUP BY active
"""
with sql.connect("data/flights.db") as conn:
    grouped_airlines_df = pd.read_sql(grouped_airlines_query, conn)

grouped_airlines_df

  active  Number of airlines
0      N                4886
1      Y                1161
2      n                   1

In [3]:
typo_query = \
"""
SELECT * 
FROM airlines
WHERE active = "n"
"""

with sql.connect('data/flights.db') as conn:
    typo_df = pd.read_sql(typo_query, conn)

typo_df

   index  id      name alias iata icao callsign country active
0     38  39  Aban Air    \N   K5  ABE     ABAN    Iran      n

In [4]:
 update_query = \
"""
UPDATE airlines 
SET active = 'N'
WHERE active = 'n'
"""

with sql.connect('data/flights.db') as conn:
    conn.execute(update_query)

with sql.connect('data/flights.db') as conn:
    typo_df = pd.read_sql(typo_query, conn)

typo_df

Empty DataFrame
Columns: [index, id, name, alias, iata, icao, callsign, country, active]
Index: []

In [6]:
#rerun the query to see the updated typo changes

grouped_airlines_query = \
"""
SELECT active, 
    COUNT() AS "Number of airlines"
FROM airlines
GROUP BY active
"""
with sql.connect("data/flights.db") as conn:
    grouped_airlines_df = pd.read_sql(grouped_airlines_query, conn)

grouped_airlines_df

  active  Number of airlines
0      N                4887
1      Y                1161

In [7]:
number_airports_query = \
"""
SELECT country, COUNT() AS "num"
FROM airports
GROUP BY country
HAVING num >= 20
ORDER BY num ASC
"""

with sql.connect("data/flights.db") as conn: 
    number_airports_df = pd.read_sql(number_airports_query, conn)

number_airports_df

          country   num
0     Afghanistan    21
1           Libya    21
2   French Guiana    22
3         Iceland    22
4         Morocco    22
..            ...   ...
75         Russia   249
76      Australia   263
77        Germany   321
78         Canada   435
79  United States  1697

[80 rows x 2 columns]

In [8]:
routes_query = \
"""
SELECT *
FROM routes
"""
with sql.connect("data/flights.db") as conn:
    routes_df = pd.read_sql(routes_query, conn)

routes_df

,index,airline,airline_id,source,source_id,dest,dest_id,codeshare,stops,equipment
0,0,2B,410,AER,2965,KZN,2990,None,0,CR2
1,1,2B,410,ASF,2966,KZN,2990,None,0,CR2
2,2,2B,410,ASF,2966,MRV,2962,None,0,CR2
3,3,2B,410,CEK,2968,KZN,2990,None,0,CR2
4,4,2B,410,CEK,2968,OVB,4078,None,0,CR2
...,...,...,...,...,...,...,...,...,...,...
67658,67658,ZL,4178,WYA,6334,ADL,3341,None,0,SF3
67659,67659,ZM,19016,DME,4029,FRU,2912,None,0,734
67660,67660,ZM,19016,FRU,2912,DME,4029,None,0,734
67661,67661,ZM,19016,FRU,2912,OSS,2913,None,0,734
67662,67662,ZM,19016,OSS,2913,FRU,2912,None,0,734

In [9]:
routesIJairlines_query = \
"""
SELECT *
FROM routes
INNER JOIN airlines
    ON routes.airline_id = airlines.id
"""
with sql.connect("data/flights.db") as conn:
    routesIJairlines_df = pd.read_sql(routesIJairlines_query, conn)

routesIJairlines_df

,index,airline,airline_id,source,source_id,dest,dest_id,codeshare,stops,equipment,index,id,name,alias,iata,icao,callsign,country,active
0,0,2B,410,AER,2965,KZN,2990,None,0,CR2,409,410,Aerocondor,\N,2B,ARD,AEROCONDOR,Portugal,Y
1,1,2B,410,ASF,2966,KZN,2990,None,0,CR2,409,410,Aerocondor,\N,2B,ARD,AEROCONDOR,Portugal,Y
2,2,2B,410,ASF,2966,MRV,2962,None,0,CR2,409,410,Aerocondor,\N,2B,ARD,AEROCONDOR,Portugal,Y
3,3,2B,410,CEK,2968,KZN,2990,None,0,CR2,409,410,Aerocondor,\N,2B,ARD,AEROCONDOR,Portugal,Y
4,4,2B,410,CEK,2968,OVB,4078,None,0,CR2,409,410,Aerocondor,\N,2B,ARD,AEROCONDOR,Portugal,Y
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
66980,67658,ZL,4178,WYA,6334,ADL,3341,None,0,SF3,4171,4178,Regional Express,\N,ZL,RXA,REX,Australia,Y
66981,67659,ZM,19016,DME,4029,FRU,2912,None,0,734,5977,19016,Apache Air,Apache,ZM,IWA,APACHE,United States,Y
66982,67660,ZM,19016,FRU,2912,DME,4029,None,0,734,5977,19016,Apache Air,Apache,ZM,IWA,APACHE,United States,Y
66983,67661,ZM,19016,FRU,2912,OSS,2913,None,0,734,5977,19016,Apache Air,Apache,ZM,IWA,APACHE,United States,Y
66984,67662,ZM,19016,OSS,2913,FRU,2912,None,0,734,5977,19016,Apache Air,Apache,ZM,IWA,APACHE,United States,Y

In [10]:
routesIJairlines_query = \
"""
SELECT airlines.name, routes.source, routes.dest
FROM routes
INNER JOIN airlines
    ON routes.airline_id = airlines.id
"""
with sql.connect("data/flights.db") as conn:
    routesIJairlines_df = pd.read_sql(routesIJairlines_query, conn)

routesIJairlines_df

#results from all records is 67663 and after inner join is 66985, this may meant hat some routes do not have airlines associated with it hence is dropped from the records

                   name source dest
0            Aerocondor    AER  KZN
1            Aerocondor    ASF  KZN
2            Aerocondor    ASF  MRV
3            Aerocondor    CEK  KZN
4            Aerocondor    CEK  OVB
...                 ...    ...  ...
66980  Regional Express    WYA  ADL
66981        Apache Air    DME  FRU
66982        Apache Air    FRU  DME
66983        Apache Air    FRU  OSS
66984        Apache Air    OSS  FRU

[66985 rows x 3 columns]

In [11]:
left_joined_routes_query = \
"""
SELECT *
FROM routes
LEFT JOIN airlines
    ON routes.airline_id = airlines.id
"""
with sql.connect("data/flights.db") as conn:
    left_joined_routes_df = pd.read_sql(left_joined_routes_query, conn)

left_joined_routes_df

,index,airline,airline_id,source,source_id,dest,dest_id,codeshare,stops,equipment,index,id,name,alias,iata,icao,callsign,country,active
0,0,2B,410,AER,2965,KZN,2990,None,0,CR2,409.0,410,Aerocondor,\N,2B,ARD,AEROCONDOR,Portugal,Y
1,1,2B,410,ASF,2966,KZN,2990,None,0,CR2,409.0,410,Aerocondor,\N,2B,ARD,AEROCONDOR,Portugal,Y
2,2,2B,410,ASF,2966,MRV,2962,None,0,CR2,409.0,410,Aerocondor,\N,2B,ARD,AEROCONDOR,Portugal,Y
3,3,2B,410,CEK,2968,KZN,2990,None,0,CR2,409.0,410,Aerocondor,\N,2B,ARD,AEROCONDOR,Portugal,Y
4,4,2B,410,CEK,2968,OVB,4078,None,0,CR2,409.0,410,Aerocondor,\N,2B,ARD,AEROCONDOR,Portugal,Y
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
67658,67658,ZL,4178,WYA,6334,ADL,3341,None,0,SF3,4171.0,4178,Regional Express,\N,ZL,RXA,REX,Australia,Y
67659,67659,ZM,19016,DME,4029,FRU,2912,None,0,734,5977.0,19016,Apache Air,Apache,ZM,IWA,APACHE,United States,Y
67660,67660,ZM,19016,FRU,2912,DME,4029,None,0,734,5977.0,19016,Apache Air,Apache,ZM,IWA,APACHE,United States,Y
67661,67661,ZM,19016,FRU,2912,OSS,2913,None,0,734,5977.0,19016,Apache Air,Apache,ZM,IWA,APACHE,United States,Y
67662,67662,ZM,19016,OSS,2913,FRU,2912,None,0,734,5977.0,19016,Apache Air,Apache,ZM,IWA,APACHE,United States,Y

In [23]:
left_joined_routes_query = \
"""
SELECT *
FROM routes
LEFT JOIN airlines  
    ON routes.airline_id = airlines.id
WHERE airlines.id IS NULL
"""
with sql.connect("data/flights.db") as conn:
    left_joined_routes_df = pd.read_sql(left_joined_routes_query, conn)

left_joined_routes_df

#LEFT JOIN shows all the columns from the left table, routes, to corresponding values from airlines table

,index,airline,airline_id,source,source_id,dest,dest_id,codeshare,stops,equipment,index,id,name,alias,iata,icao,callsign,country,active
0,312,3H,\N,AKV,5506,YIK,5504,None,0,DH8,None,None,None,None,None,None,None,None,None
1,313,3H,\N,AKV,5506,YPX,6727,None,0,DH8,None,None,None,None,None,None,None,None,None
2,314,3H,\N,XGR,5512,YVP,154,None,0,DHT BET,None,None,None,None,None,None,None,None,None
3,315,3H,\N,YGL,62,YGW,5496,None,0,DHT,None,None,None,None,None,None,None,None,None
4,316,3H,\N,YGL,62,YPX,6727,None,0,73M,None,None,None,None,None,None,None,None,None
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
673,66596,ZD,\N,DZA,915,MJN,929,None,0,AT7,None,None,None,None,None,None,None,None,None
674,66597,ZD,\N,DZA,915,NOS,930,None,0,AT7,None,None,None,None,None,None,None,None,None
675,66598,ZD,\N,HAH,912,DZA,915,None,0,AT7,None,None,None,None,None,None,None,None,None
676,66599,ZD,\N,MJN,929,DZA,915,None,0,AT7,None,None,None,None,None,None,None,None,None
677,66600,ZD,\N,NOS,930,DZA,915,None,0,AT7,None,None,None,None,None,None,None,None,None

In [22]:
full_joined_routes_query = \
"""
SELECT *
FROM routes
FULL JOIN airlines
    ON routes.airline_id = airlines.id
"""
with sql.connect("data/flights.db") as conn:
    full_joined_routes_df = pd.read_sql(full_joined_routes_query, conn)

full_joined_routes_df

,index,airline,airline_id,source,source_id,dest,dest_id,codeshare,stops,equipment,index,id,name,alias,iata,icao,callsign,country,active
0,0.0,2B,410,AER,2965,KZN,2990,None,0,CR2,409.0,410,Aerocondor,\N,2B,ARD,AEROCONDOR,Portugal,Y
1,1.0,2B,410,ASF,2966,KZN,2990,None,0,CR2,409.0,410,Aerocondor,\N,2B,ARD,AEROCONDOR,Portugal,Y
2,2.0,2B,410,ASF,2966,MRV,2962,None,0,CR2,409.0,410,Aerocondor,\N,2B,ARD,AEROCONDOR,Portugal,Y
3,3.0,2B,410,CEK,2968,KZN,2990,None,0,CR2,409.0,410,Aerocondor,\N,2B,ARD,AEROCONDOR,Portugal,Y
4,4.0,2B,410,CEK,2968,OVB,4078,None,0,CR2,409.0,410,Aerocondor,\N,2B,ARD,AEROCONDOR,Portugal,Y
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
73166,NaN,None,None,None,None,None,None,None,None,None,6043.0,19828,Vuela Cuba,Vuela Cuba,6C,6CC,None,Cuba,Y
73167,NaN,None,None,None,None,None,None,None,None,None,6044.0,19830,All Australia,All Australia,88,8K8,None,Australia,Y
73168,NaN,None,None,None,None,None,None,None,None,None,6045.0,19831,Fly Europa,None,ER,RWW,None,Spain,Y
73169,NaN,None,None,None,None,None,None,None,None,None,6046.0,19834,FlyPortugal,None,PO,FPT,FlyPortugal,Portugal,Y
73170,NaN,None,None,None,None,None,None,None,None,None,6047.0,19845,FTI Fluggesellschaft,None,None,FTI,None,Germany,N